Tekla Open API Reference for Tekla Structures 2025
Parallel.VectorToPlane Method
Overload List
Name | Description
VectorToPlane(Vector, GeometricPlane)
 Returns true if the given vector and plane are parallel.
VectorToPlane(Vector, GeometricPlane, Double)
 Returns true if the given vector and plane are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace